package com.klindziuk.task;

/*
 * Напишите программу, которая выводит в консоль “Hello, ИМЯ”, где ИМЯ берёт из командной строки.
 */

public class CommandLineName {

	public static void main(String[] args) {

		System.out.println("Hello, " + args[0]);

	}

}
